# Pandas
Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

In [1]:
## First step is to import pandas

import pandas as pd
import numpy as np

In [2]:
## Creating Dataframe using number series

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])
display(df)

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [3]:
## Playing with Dataframe

df1=pd.DataFrame(np.arange(40,80,step=2).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])
display(df1)

      Column1  Column2  Column3  Column4
Row1       40       42       44       46
Row2       48       50       52       54
Row3       56       58       60       62
Row4       64       66       68       70
Row5       72       74       76       78

In [4]:
## Accessing the elements of a row

df1.loc['Row4']

Column1    64
Column2    66
Column3    68
Column4    70
Name: Row4, dtype: int32

In [5]:
type(df1.loc['Row4'])

pandas.core.series.Series

In [6]:
## Accessing the elements of a column

df1['Column1']

Row1    40
Row2    48
Row3    56
Row4    64
Row5    72
Name: Column1, dtype: int32

In [7]:
type(df1['Column1'])

pandas.core.series.Series

In [8]:
# To select all rows and columns
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [9]:
# To select some rows and columns to form new dataframe
df.iloc[1:,2:]

      Column3  Column4
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

In [10]:
df.iloc[1:3,1:4]

      Column2  Column3  Column4
Row2        5        6        7
Row3        9       10       11

In [11]:
#convert Dataframes into array by skipping column names and row names .... using values
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [12]:
# To check number of missing values
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [13]:
# To check number of unique values present in a column
df['Column2'].value_counts()

1     1
5     1
9     1
13    1
17    1
Name: Column2, dtype: int64

In [14]:
# To check number of unique values present in a column
df['Column2'].unique()

array([ 1,  5,  9, 13, 17])

In [15]:
# Selecting multiple columns....... by creating list
df[['Column2','Column1']]

      Column2  Column1
Row1        1        0
Row2        5        4
Row3        9        8
Row4       13       12
Row5       17       16